NextFOAM-2401/tutorials/multiphase/reactingMultiphaseEulerFoam/RAS/wallBoiling1D_3phase/0.orig/T.gas2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.gas2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 368;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 368;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.gas;
        inletValue      uniform 368;
        value           uniform 368;
    }

    wall1
    {
        type            copiedFixedValue;
        sourceFieldName T.liquid;
        value           uniform 368;
    }

    wall2
    {
        type            copiedFixedValue;
        sourceFieldName T.liquid;
        value           uniform 368;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
